{
  "projects": [
    {
      "id": 0,
      "type": "application",
      "title": "Exercise Application",
      "description": "A fitness tracking application designed to help users monitor their workout progress by providing accurate timing and tracking features.",
      "problem_statement": "Users struggle to accurately track workout sessions, leading to inconsistent fitness progress and difficulty in maintaining workout routines. This app provides a seamless solution with an integrated stopwatch and tracking system.",
      "challenges": [
        "Ensuring precise stopwatch functionality with millisecond accuracy.",
        "Optimizing UI responsiveness for various screen sizes.",
        "Handling background activity without disrupting active workout tracking."
      ],
      "objectives": null,
      "design_versions": [
        "Basic Timer: Focused on stopwatch functionality only.",
        "Enhanced UI: Introduced a dark mode and intuitive interface.",
        "Advanced Analytics: Added real-time progress tracking and statistics."
      ],
      "process": null,
      "features": [
        "Stopwatch: Track session time accurately.",
        "Real-time progress tracking and data logging.",
        "Custom workout modes with personalized timers.",
        "Dark mode for a better user experience during night workouts.",
        "Minimalist and intuitive UI for easy navigation."
      ],
      "tech": [
        "React Native",
        "JavaScript"
      ],
      "role": null,
      "impact": null,
      "date": "2024-04-21",
      "image": "Assets/React Projects/Exercise Menu.png",
      "demo": "Assets/Demos/Exercise App.mp4",
      "github": "https://github.com/th667247/th667247.github.io/tree/22cd2ab21bed33aa3a6656c6cdbf01009c23b8eb/Projects/Exercise%20App"
    },
    {
      "id": 2,
      "type": "application",
      "title": "Todo Application",
      "description": "A productivity tool designed to help users organize and manage their tasks effectively.",
      "problem_statement": "Users often struggle to manage and prioritize their tasks, leading to inefficiencies in their daily activities. This app provides an intuitive interface to help users create, track, and complete tasks with ease.",
      "challenges": [
        "Integrating user authentication, registration, and task tracking into one project.",
        "Ensuring smooth navigation across different task categories.",
        "Optimizing app performance for seamless task updates."
      ],
      "objectives": [
        "Enable users to manage tasks efficiently with a simple and intuitive UI.",
        "Implement authentication for personalized task management.",
        "Ensure smooth navigation and real-time task updates."
      ],
      "tech": [
        "React",
        "JavaScript"
      ],
      "image": "Assets/React Projects/To Do.png",
      "demo": "Assets/Demos/To Do App Demo.mp4",
      "github": "https://github.com/th667247/th667247.github.io/tree/3b624c2353b5caa00ae9ccf7b67629a948c3491a/Projects/Todo%20App"
    },
    {
      "id": 3,
      "title": "Quiz Application",
      "type": "application",
      "description": "An interactive quiz app built using React Native, providing users with engaging quizzes on various topics.",
      "problem_statement": "Users need a fun and engaging way to test their knowledge while improving retention. This app offers a user-friendly interface for taking quizzes on different subjects.",
      "features": [
        "Multiple-choice quizzes with randomized questions.",
        "Timed quizzes for added challenge.",
        "Score tracking and performance analytics."
      ],
      "tech": [
        "React Native",
        "JavaScript"
      ],
      "image": "Assets/React Projects/Quiz.png",
      "demo": "Assets/Demos/Quiz Demo.mp4",
      "github": "https://github.com/th667247/th667247.github.io/tree/3b624c2353b5caa00ae9ccf7b67629a948c3491a/Projects/Quiz%20App"
    },
    {
      "id": 4,
      "title": "Flash Card Design",
      "type": "design",
      "description": "A Figma-based design prototype for creating digital flash cards.",
      "tech": [
        "Figma"
      ],
      "image": "Assets/Figma projects/Design Flash Card App.png",
      "demo": "https://www.figma.com/proto/WdUpSPH08iZHgekV5m9Hx9/Design-Flash-Card-App?node-id=1-765&p=f&t=A2ZjPexOWCZFmni3-0&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1",
      "github": null
    },
    {
      "id": 5,
      "title": "Exercise Design",
      "type": "design",
      "description": "A UI/UX design prototype for a fitness tracking app, developed in Figma to optimize user experience.",
      "tech": [
        "Figma"
      ],
      "image": "Assets/Figma projects/Exercise App Design.png",
      "demo": "https://www.figma.com/proto/sqeDPOHkEDgOCaMw29wFf5/Exercise-App-Design?node-id=1-6413&p=f&t=j83p7hsny4OJvOUu-1&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1",
      "github": null
    },
    {
      "id": 6,
      "title": "Todo Design",
      "type": "design",
      "description": "A Figma-based design prototype for a to-do app, focusing on simplicity and functionality.",
      "tech": [
        "Figma"
      ],
      "image": "Assets/Figma projects/TODO App Design.png",
      "demo": "https://www.figma.com/proto/OgAwD4RNJBWPDC1LFEhklR/TODO-App-Design?node-id=3-1536&p=f&t=DkE1gPoQztzTUSXg-1&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1",
      "github": null
    },
    {
      "id": 7,
      "title": "Mystical Realms",
      "type": "design",
      "description": "Mystical Realms is a fantasy-inspired UI/UX project created in Figma and Procreate. It explores the use of pixel art and vibrant color schemes to enhance a captivating game narrative. The project focuses on accessibility, art direction, and storytelling through a carefully crafted design process.",
      "tech": ["Figma", "Procreate"],
      "problem_statement": "How can game design balance nostalgia, accessibility, and immersive storytelling while maintaining a distinct art style?",
      "challenges": [
        "Transitioning from a mobile-polished aesthetic to a pixelated 2D style.",
        "Ensuring visual clarity while using pixel art.",
        "Creating a vibrant color palette that enhances storytelling without overshadowing gameplay."
      ],
      "objectives": [
        "Design an engaging fantasy world with a cohesive visual identity.",
        "Optimize pixel art for clarity and accessibility.",
        "Utilize color theory to evoke emotions and enhance the game's atmosphere."
      ],
      "design_versions": [
        {
          "title": "Aesthetic Summary",
          "description": "The evolution of the art style in my game has been a journey of exploration and discovery. Initially conceived with a sketched and polished aesthetic that hinted at a mobile gaming experience, the project took an unexpected turn towards a pixelated 2D style. This transition proved transformative, breathing new life into the game with its retro charm and simplicity.",
          "image": "Assets/Mystical Realms/Game_Narrative.png"
        },
        {
          "title": "Pixel Art & Accessibility",
          "description": "The decision to embrace pixel art was driven by its ability to inject vitality into the game effortlessly. Its nostalgic appeal resonates with players while allowing for a more accessible development process. By simplifying the visual elements, the focus shifts towards the core gameplay and narrative, enhancing the overall experience.",
          "image": "Assets/Mystical Realms/Character_Color_Palettes.png"
        },
        {
          "title": "Use of Vibrant Colors",
          "description": "Vibrant colors play a pivotal role in setting the tone and atmosphere of the game world. Each hue is carefully selected to evoke emotions and immerse players in the environment without overshadowing the narrative. This deliberate use of color adds depth and richness to the pixelated landscapes, further enhancing the player's engagement and connection to the game.",
          "image": "Assets/Mystical Realms/Environments_Color_Palettes.png"
        },
        {
          "title": "Final Art Direction",
          "description": "The art style of my game is a testament to the creative journey it has undertaken. From its humble beginnings to its pixelated fruition, every design choice has been made with the player's experience in mind, ensuring that the game captivates and inspires at every turn.",
          "image": "Assets/Mystical Realms/Final_GIF_2.gif"
        }
      ],
      "process": [
        {
          "title": "Game Narrative",
          "description": "Intrigued by the mysterious aura, you follow a winding path until you stumble upon an ancient well, its surface cloaked in lush moss. As curiosity overtakes caution, you reach out to touch the well's moss-covered surface. In that fleeting moment, a sudden gust of wind swirls around you, pushing you into the depths of the well. The world around you dissolves into a mesmerizing whirl of ethereal colors. When you awaken, you find yourself in surroundings eerily familiar yet unmistakably different—a world that once existed only within the pages of fables. As you navigate this fantastical realm, you'll encounter guardian-like creatures, friends, and foes. Together, you embark on an unforgettable journey, unraveling the secrets of new worlds and discovering the enchanting tales hidden within 'Mystical Realms.'",
          "image": "Assets/Mystical Realms/Game_Narrative.png"
        }
      ],
      "features": [
        {
          "title": "Settings UI",
          "image": "Assets/Mystical Realms/Settings.jpg"
        },
        {
          "title": "Concept Art",
          "image": "Assets/Mystical Realms/concept_art.jpg"
        },
        {
          "title": "Proportion & Scale Studies",
          "image": "Assets/Mystical Realms/Proportion_Scale.png"
        }
      ],
      "role": "Lead Designer, responsible for art direction, UI/UX design, and narrative development.",
      "impact": "The project refined pixel art techniques while exploring color theory for storytelling. It also served as a foundation for future fantasy-themed UI/UX projects.",
      "date": "2024-03-15",
      "image": "Assets/Mystical Realms/Mystical Realms.png",
      "demo": null,
      "github": null
    },
        
    {
      "id": 9,
      "title": "Labyrinth",
      "type": "application",
      "description": "Labyrinth is a user-focused digital reading application designed to enhance the reading experience for casual readers, book lovers, and academic users. As one of the lead designers on Team Labyrinth, I worked on improving usability, navigation, and social engagement to create a seamless and personalized reading platform.",
      "problem_statement": "Existing e-reading platforms often come with frustrating navigation, limited search options, and a lack of community-driven engagement. Our goal was to design an intuitive, feature-rich application that bridges the gap between individual reading experiences and social interaction, making it easier for users to discover, read, and connect with others over books.",
      "challenges": [
        "Navigation confusion: Users struggled with unintended page transitions.",
        "Limited search functionality: Initial version lacked advanced filtering options.",
        "UI inconsistencies: Some sections lacked clarity, leading to user errors."
      ],
      "objectives": [
        "Develop an AI-powered recommendation system for personalized book discovery.",
        "Improve user engagement with interactive reading features.",
        "Integrate community-driven features such as book clubs and discussions.",
        "Library loading issues: The library page occasionally stalled, affecting user experience."
      ],
      "design_versions": [
        {
          "image": null,
          "description": "Prototype showcasing the early wireframes."
        },
        {
          "image": "Assets/Labyrinth/Conservative.png",
          "description": "Conservative: Minimalist and structured for easy navigation."
        },
        {
          "image": "Assets/Labyrinth/Moderate.png",
          "description": "Moderate: Balanced aesthetics with a dark mode and vibrant interface."
        },
        {
          "image": "Assets/Labyrinth/Wild.png",
          "description": "Wild: A colorful and social media-style approach."
        }
      ],
      "process": [
        "Market Research: Analyzed competitors like Libby, Kindle, and Goodreads to identify strengths and weaknesses.",
        "User Research: Conducted surveys and interviews with over 200 readers to understand pain points in existing platforms.",
        "Prototyping: Created paper sketches, Adobe XD wireframes, and high-fidelity Figma prototypes to refine the user experience.",
        {
          "image": "Assets/Labyrinth/Navigation Structure.png"
        },
        "Usability Testing: Validating Design Choices. Goal: Ensure Labyrinth’s design is intuitive and meets user expectations.",
        "Testing Methods: Think-Aloud Testing – Users were asked to verbalize their thoughts while navigating Labyrinth. Task-Based Testing – Users were given specific tasks like finding a book, joining a book club, and adjusting reading preferences. A/B Testing – Different UI layouts were tested to determine which was more user-friendly.",
        "Key Insights from Testing: Users preferred the 'Moderate' UI version over minimalist and social-heavy versions. Onboarding was confusing initially, leading to a redesigned guided tutorial for first-time users.Search needed advanced filtering (tags, author, genre, recommendation-based)",
        {
          "image": null
        },
        "Refinements: Data-Driven Improvements – Implemented major changes based on usability testing feedback. Added breadcrumb trails, clear back buttons, and tab-based categorization to improve usability.",
        "Smarter Search: Implemented AI-powered recommendations and multi-filter options for enhanced book discovery.",
        "Interactive Social Features: Incorporated book discussions, live annotations, and book club integration for a community-driven reading experience.",
        {
          "image": "Assets/Labyrinth/Style_Guide - Copy.png"
        },
        "Final Outcome: User error rate reduced by 40% after UI refinements, search efficiency improved by 25%, and engagement in the app increased by 30%.",
        "Accessibility & Customization: Added font adjustments, background themes, and audiobook integration for an inclusive experience."
      ],
      "features": [
        "AI-powered book recommendations",
        "Advanced search filters (genre, author, user preferences)",
        "Community & social features (book clubs, messaging)",
        "Personalized reading settings (fonts, themes, accessibility)",
        "Interactive reading tools (highlighting, note-taking, progress tracking)"
      ],
      "tech": [
        "Figma",
        "Adobe XD",
        "Canva"
      ],
      "role": [
        {
          "image": "Assets/Labyrinth/Organizational Chart.png"
        }
      ],
      "impact": [
        "Improve user engagement by 30% through personalized book recommendations.",
        "Reduce navigation errors by 40% after refining the onboarding process.",
        "Enhance search efficiency, leading to a 25% faster book discovery time."
      ],
      "date": "2024-03-15",
      "image": "Assets/Labyrinth/Labyrinth.png",
      "demo": "https://www.figma.com/proto/efX3KwG6JmIGlQa7I3RXNx/Labyrinth?node-id=103-5671&p=f&t=fRxjODo5lCG75bbN-1&scaling=contain&content-scaling=fixed&page-id=101%3A37&starting-point-node-id=103%3A5671",
      "github": "Assets/Labyrinth/Labyrinth Full Report.pdf"
    }
  ]
}